# More Pandas, Part 2

We can get the csv of the Austin Animal Center data [here](https://data.austintexas.gov/Health-and-Community-Services/Austin-Animal-Center-Outcomes/9t4d-g238). Click on 'Export' and then a 'CSV' link will appear.

In [2]:
import numpy as np
import pandas as pd
animals = pd.read_csv('/Users/LeanaCritchell/Downloads/Austin_Animal_Center_Outcomes.csv')
animals.head()

,Animal ID,Name,DateTime,MonthYear,Date of Birth,Outcome Type,Outcome Subtype,Animal Type,Sex upon Outcome,Age upon Outcome,Breed,Color
0,A794011,Chunk,05/08/2019 06:20:00 PM,05/08/2019 06:20:00 PM,05/02/2017,Rto-Adopt,NaN,Cat,Neutered Male,2 years,Domestic Shorthair Mix,Brown Tabby/White
1,A776359,Gizmo,07/18/2018 04:02:00 PM,07/18/2018 04:02:00 PM,07/12/2017,Adoption,NaN,Dog,Neutered Male,1 year,Chihuahua Shorthair Mix,White/Brown
2,A720371,Moose,02/13/2016 05:59:00 PM,02/13/2016 05:59:00 PM,10/08/2015,Adoption,NaN,Dog,Neutered Male,4 months,Anatol Shepherd/Labrador Retriever,Buff
3,A674754,NaN,03/18/2014 11:47:00 AM,03/18/2014 11:47:00 AM,03/12/2014,Transfer,Partner,Cat,Intact Male,6 days,Domestic Shorthair Mix,Orange Tabby
4,A689724,*Donatello,10/18/2014 06:52:00 PM,10/18/2014 06:52:00 PM,08/01/2014,Adoption,NaN,Cat,Neutered Male,2 months,Domestic Shorthair Mix,Black

### 3. Reshaping a DataFrame

#### .pivot()

Those of you familiar with Excel have probably used Pivot Tables. Pandas has a similar functionality.

In [3]:
animals.pivot(values='Age upon Outcome', columns='Animal Type').head()

Animal Type Bird       Cat       Dog Livestock Other
0            NaN   2 years       NaN       NaN   NaN
1            NaN       NaN    1 year       NaN   NaN
2            NaN       NaN  4 months       NaN   NaN
3            NaN    6 days       NaN       NaN   NaN
4            NaN  2 months       NaN       NaN   NaN

Grouping by two different columns can be very helpful, but it has the unsavory side effect of creating a two-level index. This can be a good time to use `.pivot()` or `.pivot_table()`.

In [4]:
animals.groupby(by=['Outcome Type', 'Sex upon Outcome']).agg(len)

                                  Animal ID   Name  DateTime  MonthYear  \
Outcome Type    Sex upon Outcome
Adoption        Intact Female          1146   1146      1146       1146
                Intact Male             985    985       985        985
                Neutered Male         25065  25065     25065      25065
                Spayed Female         24499  24499     24499      24499
                Unknown                 136    136       136        136
Died            Intact Female           267    267       267        267
                Intact Male             334    334       334        334
                Neutered Male            87     87        87         87
                Spayed Female            76     76        76         76
                Unknown                 315    315       315        315
Disposal        Intact Female            21     21        21         21
                Intact Male              49     49        49         49
                Neutered Male             6      6         6          6
                Spayed Female             6      6         6          6
                Unknown                 415    415       415        415
Euthanasia      Intact Female           968    968       968        968
                Intact Male            1159   1159      1159       1159
                Neutered Male           778    778       778        778
                Spayed Female           488    488       488        488
                Unknown                4521   4521      4521       4521
Missing         Intact Female            20     20        20         20
                Intact Male              22     22        22         22
                Neutered Male             7      7         7          7
                Spayed Female            14     14        14         14
                Unknown                   4      4         4          4
Relocate        Intact Female             1      1         1          1
                Unknown                  19     19        19         19
Return to Owner Intact Female          2368   2368      2368       2368
                Intact Male            3537   3537      3537       3537
                Neutered Male          8419   8419      8419       8419
                Spayed Female          6193   6193      6193       6193
                Unknown                 156    156       156        156
Rto-Adopt       Intact Female            24     24        24         24
                Intact Male              31     31        31         31
                Neutered Male           331    331       331        331
                Spayed Female           226    226       226        226
                Unknown                   1      1         1          1
Transfer        Intact Female          9730   9730      9730       9730
                Intact Male            8830   8830      8830       8830
                Neutered Male          6617   6617      6617       6617
                Spayed Female          5645   5645      5645       5645
                Unknown                4136   4136      4136       4136

                                  Date of Birth  Outcome Subtype  Animal Type  \
Outcome Type    Sex upon Outcome
Adoption        Intact Female              1146             1146         1146
                Intact Male                 985              985          985
                Neutered Male             25065            25065        25065
                Spayed Female             24499            24499        24499
                Unknown                     136              136          136
Died            Intact Female               267              267          267
                Intact Male                 334              334          334
                Neutered Male                87               87           87
                Spayed Female                76               76           76
                Unknown                     315              315          315
Disposal        Intact Female                21               21           21
                Intact Male                  49               49           49
                Neutered Male                 6                6            6
                Spayed Female                 6                6            6
                Unknown                     415              415          415
Euthanasia      Intact Female               968              968          968
                Intact Male                1159             1159         1159
                Neutered Male               778              778          778
                Spayed Female               488              488          488
                Unknown                    4521             4521         4521
Missing         Intact Female                20               20           20
                Intact Male                  22               22           22
                Neutered Male                 7                7            7
                Spayed Female                14               14           14
                Unknown                       4                4            4
Relocate        Intact Female                 1                1            1
                Unknown                      19               19           19
Return to Owner Intact Female              2368             2368         2368
                Intact Male                3537             3537         3537
                Neutered Male              8419             8419         8419
                Spayed Female              6193             6193         6193
                Unknown                     156              156          156
Rto-Adopt       Intact Female                24               24           24
                Intact Male                  31               31           31
                Neutered Male               331              331          331
                Spayed Female               226              226          226
                Unknown                       1                1            1
Transfer        Intact Female              9730             9730         9730
                Intact Male                8830             8830         8830
                Neutered Male              6617             6617         6617
                Spayed Female              5645             5645         5645
                Unknown                    4136             4136         4136

                                  Age upon Outcome  Breed  Color
Outcome Type    Sex upon Outcome
Adoption        Intact Female                 1146   1146   1146
                Intact Male                    985    985    985
                Neutered Male                25065  25065  25065
                Spayed Female                24499  24499  24499
                Unknown                        136    136    136
Died            Intact Female                  267    267    267
                Intact Male                    334    334    334
                Neutered Male                   87     87     87
                Spayed Female                   76     76     76
                Unknown                        315    315    315
Disposal        Intact Female                   21     21     21
                Intact Male                     49     49     49
                Neutered Male                    6      6      6
                Spayed Female                    6      6      6
                Unknown                        415    415    415
Euthanasia      Intact Female                  968    968    968
                Intact Male                   1159   1159   1159
                Neutered Male                  778    778    778
                Spayed Female                  488    488    488
                Unknown                       4521   4521   4521
Missing         Intact Female                   20     20     20
                Intact Male                     22     22     22
                Neutered Male                    7      7      7
                Spayed Female                   14     14     14
                Unknown                          4      4      4
Relocate        Intact Female                    1      1      1
                Unknown                         19     19     19
Return to Owner Intact Female                 2368   2368   2368
                Intact Male                   3537   3537   3537
                Neutered Male                 8419   8419   8419
                Spayed Female                 6193   6193   6193
                Unknown                        156    156    156
Rto-Adopt       Intact Female                   24     24     24
                Intact Male                     31     31     31
                Neutered Male                  331    331    331
                Spayed Female                  226    226    226
                Unknown                          1      1      1
Transfer        Intact Female                 9730   9730   9730
                Intact Male                   8830   8830   8830
                Neutered Male                 6617   6617   6617
                Spayed Female                 5645   5645   5645
                Unknown                       4136   4136   4136

In [5]:
animals.pivot_table(index='Outcome Type', columns='Sex upon Outcome', aggfunc=len)

                 Age upon Outcome                                          \
Sex upon Outcome    Intact Female Intact Male Neutered Male Spayed Female
Outcome Type
Adoption                   1146.0       985.0       25065.0       24499.0
Died                        267.0       334.0          87.0          76.0
Disposal                     21.0        49.0           6.0           6.0
Euthanasia                  968.0      1159.0         778.0         488.0
Missing                      20.0        22.0           7.0          14.0
Relocate                      1.0         NaN           NaN           NaN
Return to Owner            2368.0      3537.0        8419.0        6193.0
Rto-Adopt                    24.0        31.0         331.0         226.0
Transfer                   9730.0      8830.0        6617.0        5645.0

                             Animal ID                            \
Sex upon Outcome Unknown Intact Female Intact Male Neutered Male
Outcome Type
Adoption           136.0        1146.0       985.0       25065.0
Died               315.0         267.0       334.0          87.0
Disposal           415.0          21.0        49.0           6.0
Euthanasia        4521.0         968.0      1159.0         778.0
Missing              4.0          20.0        22.0           7.0
Relocate            19.0           1.0         NaN           NaN
Return to Owner    156.0        2368.0      3537.0        8419.0
Rto-Adopt            1.0          24.0        31.0         331.0
Transfer          4136.0        9730.0      8830.0        6617.0

                                        ...          Name              \
Sex upon Outcome Spayed Female Unknown  ... Intact Female Intact Male
Outcome Type                            ...
Adoption               24499.0   136.0  ...        1146.0       985.0
Died                      76.0   315.0  ...         267.0       334.0
Disposal                   6.0   415.0  ...          21.0        49.0
Euthanasia               488.0  4521.0  ...         968.0      1159.0
Missing                   14.0     4.0  ...          20.0        22.0
Relocate                   NaN    19.0  ...           1.0         NaN
Return to Owner         6193.0   156.0  ...        2368.0      3537.0
Rto-Adopt                226.0     1.0  ...          24.0        31.0
Transfer                5645.0  4136.0  ...        9730.0      8830.0

                                                     Outcome Subtype  \
Sex upon Outcome Neutered Male Spayed Female Unknown   Intact Female
Outcome Type
Adoption               25065.0       24499.0   136.0          1146.0
Died                      87.0          76.0   315.0           267.0
Disposal                   6.0           6.0   415.0            21.0
Euthanasia               778.0         488.0  4521.0           968.0
Missing                    7.0          14.0     4.0            20.0
Relocate                   NaN           NaN    19.0             1.0
Return to Owner         8419.0        6193.0   156.0          2368.0
Rto-Adopt                331.0         226.0     1.0            24.0
Transfer                6617.0        5645.0  4136.0          9730.0


Sex upon Outcome Intact Male Neutered Male Spayed Female Unknown
Outcome Type
Adoption               985.0       25065.0       24499.0   136.0
Died                   334.0          87.0          76.0   315.0
Disposal                49.0           6.0           6.0   415.0
Euthanasia            1159.0         778.0         488.0  4521.0
Missing                 22.0           7.0          14.0     4.0
Relocate                 NaN           NaN           NaN    19.0
Return to Owner       3537.0        8419.0        6193.0   156.0
Rto-Adopt               31.0         331.0         226.0     1.0
Transfer              8830.0        6617.0        5645.0  4136.0

[9 rows x 50 columns]

### 4. Methods for Combining DataFrames: .join(), .merge(), .concat(), .melt()

#### .join()

In [6]:
toy1 = pd.DataFrame([[63, 142], [33, 47]], columns=['age', 'HP'])
toy2 = pd.DataFrame([[63, 100], [33, 200]], columns=['age', 'MP'])

In [7]:
toy1

   age   HP
0   63  142
1   33   47

In [8]:
toy2

   age   MP
0   63  100
1   33  200

In [9]:
toy1.set_index('age').join(toy2.set_index('age'))

      HP   MP
age
63   142  100
33    47  200

For more on this method, check out the [doc](https://pandas.pydata.org/pandas-docs/stable/reference/api/pandas.DataFrame.join.html)!

#### .merge()

In [10]:
ds_chars = pd.read_csv('ds_chars.csv', index_col=0)
ds_chars

     name   HP home_state
0    greg  200         WA
1   miles  200         WA
2    alan  170         TX
3  alison  300         DC
4  rachel  200         TX

In [11]:
states = pd.read_csv('states.csv', index_col=0)
states

  state   nickname     capital
0    WA  evergreen     Olympia
1    TX      alamo      Austin
2    DC   district  Washington
3    OH    buckeye    Columbus
4    OR     beaver       Salem

In [14]:
ds_chars.merge(states, left_on='home_state', right_on='state', how='inner')

     name   HP home_state state   nickname     capital
0    greg  200         WA    WA  evergreen     Olympia
1   miles  200         WA    WA  evergreen     Olympia
2    alan  170         TX    TX      alamo      Austin
3  rachel  200         TX    TX      alamo      Austin
4  alison  300         DC    DC   district  Washington

#### pd.concat()

This method takes a *list* of pandas objects as arguments.

N.B. The cell below may produce a **Deprecation Warning**.

In [15]:
ds_full = pd.concat([ds_chars, states])
ds_full

/opt/anaconda3/envs/learn-env/lib/python3.6/site-packages/ipykernel_launcher.py:1: FutureWarning: Sorting because non-concatenation axis is not aligned. A future version
of pandas will change to not sort by default.

To accept the future behavior, pass 'sort=False'.

To retain the current behavior and silence the warning, pass 'sort=True'.

  """Entry point for launching an IPython kernel.

      HP     capital home_state    name   nickname state
0  200.0         NaN         WA    greg        NaN   NaN
1  200.0         NaN         WA   miles        NaN   NaN
2  170.0         NaN         TX    alan        NaN   NaN
3  300.0         NaN         DC  alison        NaN   NaN
4  200.0         NaN         TX  rachel        NaN   NaN
0    NaN     Olympia        NaN     NaN  evergreen    WA
1    NaN      Austin        NaN     NaN      alamo    TX
2    NaN  Washington        NaN     NaN   district    DC
3    NaN    Columbus        NaN     NaN    buckeye    OH
4    NaN       Salem        NaN     NaN     beaver    OR

`pd.concat()`â€“â€“and many other pandas operationsâ€“â€“make use of an `axis` parameter. For this particular method I need to specify whether I want to concatenate the DataFrames *row-wise* (`axis=0`) or *column-wise* (`axis=1`). The default is `axis=0`, so let's override that!

In [16]:
ds_full = pd.concat([ds_chars, states], axis=1)
ds_full

     name   HP home_state state   nickname     capital
0    greg  200         WA    WA  evergreen     Olympia
1   miles  200         WA    TX      alamo      Austin
2    alan  170         TX    DC   district  Washington
3  alison  300         DC    OH    buckeye    Columbus
4  rachel  200         TX    OR     beaver       Salem

#### pd.melt()

Melting removes the structure from your DataFrame and puts the data in a 'variable' and 'value' format.

In [17]:
pd.melt(ds_full)

      variable       value
0         name        greg
1         name       miles
2         name        alan
3         name      alison
4         name      rachel
5           HP         200
6           HP         200
7           HP         170
8           HP         300
9           HP         200
10  home_state          WA
11  home_state          WA
12  home_state          TX
13  home_state          DC
14  home_state          TX
15       state          WA
16       state          TX
17       state          DC
18       state          OH
19       state          OR
20    nickname   evergreen
21    nickname       alamo
22    nickname    district
23    nickname     buckeye
24    nickname      beaver
25     capital     Olympia
26     capital      Austin
27     capital  Washington
28     capital    Columbus
29     capital       Salem

[Here](https://towardsdatascience.com/transforming-data-in-python-with-pandas-melt-854221daf507) is a use case for `pd.melt()`.

### 5. Making Use of Categories: One-Hot Encoding

Pandas has a one-hot encoder called `get_dummies()`, which is good for exploratory data analysis (EDA).

This might be good to use if we're in the **data-understanding** stage (Stage 2) of our CRISP-DM process.

We can call it on a DataFrame as a whole or on a Series (column).

In [20]:
pd.get_dummies(animals['Animal Type'])

        Bird  Cat  Dog  Livestock  Other
0          0    1    0          0      0
1          0    0    1          0      0
2          0    0    1          0      0
3          0    1    0          0      0
4          0    1    0          0      0
...      ...  ...  ...        ...    ...
117657     0    0    1          0      0
117658     0    1    0          0      0
117659     0    1    0          0      0
117660     0    0    0          0      1
117661     0    1    0          0      0

[117662 rows x 5 columns]

If however we're in a later stage of the process and we're interested, say, in preparing a data pipeline, `pandas.get_dummies()` will prove inferior to other tools.

In practice, we will **not** use `pandas.get_dummies()`. The library Scikit-Learn (`sklearn`, included with your Anaconda installation) has a `OneHotEncoder` class that creates an object that persists. This makes it much more apt for production environments, and so it's good to get in the habit of using it.

Ultimately, we will use **many** tools from sklearn.

In [21]:
from sklearn.preprocessing import OneHotEncoder

In [22]:
ohe = OneHotEncoder()

In [23]:
ohe.fit(animals[['Animal Type']])

OneHotEncoder(categorical_features=None, categories=None, drop=None,
              dtype=<class 'numpy.float64'>, handle_unknown='error',
              n_values=None, sparse=True)

Now that the `OneHotEncoder` has been fitted to our data, it has newly available attributes and methods. In particular, it has access to the different categories that we're replacing:

In [24]:
ohe.get_feature_names()

array(['x0_Bird', 'x0_Cat', 'x0_Dog', 'x0_Livestock', 'x0_Other'],
      dtype=object)

We'll have much more to say about `sklearn` syntax and about Python's object structure. But let's now transform our data to see what the new table looks like:

In [25]:
ohe.transform(animals[['Animal Type']])

<117662x5 sparse matrix of type '<class 'numpy.float64'>'
	with 117662 stored elements in Compressed Sparse Row format>

For the sake of saving storage space, the return is a **sparse matrix**, but we can "re-inflate it if we want to see it in tabular form:

In [26]:
types_encoded = ohe.transform(animals[['Animal Type']]).todense()
types_encoded

matrix([[0., 1., 0., 0., 0.],
        [0., 0., 1., 0., 0.],
        [0., 0., 1., 0., 0.],
        ...,
        [0., 1., 0., 0., 0.],
        [0., 0., 0., 0., 1.],
        [0., 1., 0., 0., 0.]])

Let's put it into a DataFrame:

In [27]:
pd.DataFrame(types_encoded, columns=ohe.get_feature_names()).head()

   x0_Bird  x0_Cat  x0_Dog  x0_Livestock  x0_Other
0      0.0     1.0     0.0           0.0       0.0
1      0.0     0.0     1.0           0.0       0.0
2      0.0     0.0     1.0           0.0       0.0
3      0.0     1.0     0.0           0.0       0.0
4      0.0     1.0     0.0           0.0       0.0